app/Controllers/Designus.php

    public function mostrarSneakers()
    {
        $sneakerModel = model('SneakerModel');
        // $session = session();
         //if($session->get('logged_in')!=TRUE){
          //   return redirect('usuario/login','refresh');
        // }


         $data['sneakers'] = $sneakerModel->findAll();
---
SELECT *
FROM `sneakers`

    public function mostrarMarcas()
    {
        $marcaModel = model('MarcaModel');
        // $session = session();
         //if($session->get('logged_in')!=TRUE){
          //   return redirect('usuario/login','refresh');
        // }


         $data['MarcaSneakers'] = $marcaModel->findAll();
---
SELECT *
FROM `MarcaSneakers`