app/Controllers/Marca.php

SELECT *
FROM `MarcaSneakers`
---
    public function mostrar(){
        $marcaModel = model('MarcaModel');
       // $session = session();
        //if($session->get('logged_in')!=TRUE){
         //   return redirect('usuario/login','refresh');
       // }


        $data['MarcaSneakers'] = $marcaModel->findAll();