app/Controllers/Sneaker.php

    public function mostrar(){
        $sneakerModel = model('SneakerModel');
       // $session = session();
        //if($session->get('logged_in')!=TRUE){
         //   return redirect('usuario/login','refresh');
       // }


        $data['sneakers'] = $sneakerModel->findAll();
---
SELECT *
FROM `sneakers`

    public function delete($id){
        $sneakerModel = model('SneakerModel');
        $sneakerModel->delete($id);
---
DELETE FROM `sneakers`
WHERE `id` IN ('14')

    public function editar($id){
        $sneakerModel = model('SneakerModel');
        $data['sneaker'] = $sneakerModel->find($id);
---
SELECT *
FROM `sneakers`
WHERE `sneakers`.`id` = '1'