app/Controllers/Usuario.php

    public function mostrar(){
        $usuarioModel = model('UsuarioModel');
       // $session = session();
        //if($session->get('logged_in')!=TRUE){
         //   return redirect('usuario/login','refresh');
       // }

        $data['usuarios'] = $usuarioModel->findAll();
---
SELECT *
FROM `Usuarios`

    public function editar($id){
        $usuarioModel = model('UsuarioModel');
        $data['usuario'] = $usuarioModel->find($id);
---
SELECT *
FROM `Usuarios`
WHERE `Usuarios`.`id` = '1'